misc/EchoRequest2.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENV:mustUnderstand="1">
      <wsse:UsernameToken wsu:Id="UsernameToken-ffb75910-1272-4bcd-858a-c95833eaafd8">
        <wsse:Username>xyz</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">vjgtIvo/6u0wjgq8pFJG7+56MZs=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">EHIx2UCi6fruAFzle35xHw==</wsse:Nonce>
        <wsu:Created>2025-06-11T17:43:39.764Z</wsu:Created>
      </wsse:UsernameToken>
      <wsu:Timestamp wsu:Id="TS-22a883de-6fe3-445e-a9f8-7c333449d1d2">
        <wsu:Created>2025-06-11T17:43:39.756Z</wsu:Created>
        <wsu:Expires>2025-06-11T17:48:39.756Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
    <v4:WebServiceClientId xmlns:v4="http://ec.europa.eu/sanco/tracesnt/base/v4">eudr-test</v4:WebServiceClientId>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <ns2:EudrEchoRequest xmlns:ns2="http://ec.europa.eu/tracesnt/eudr/echo">
      <ns2:query>Hallo EUDR Echo Service!</ns2:query>
    </ns2:EudrEchoRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>